{
  "work": [
    {
      "company": "Loyalty Company",
      "title": "Mobile Developer Intern",
      "short_desc": "Developed Android, iOS and Javascript application for a marketing company.",
      "desc": "I developed mostly Android applications, but also some iOS and Javascript application for the clients of Loyalty Company, a marketing agency based in Lyon, France. I had the chance to be very autonomous, so I could choose myself the architecture of my projects.\n During this internship, I faced short deadlines, which is quit exciting as you have to work like in a Hackathon somtime. But what I've enjoyed the most was to have a global overview of the projects' process by talking a lot with the marketing project's managers and the technical managers.",
      "date_begin": "11/05/2015",
      "end_date": "11/09/2015",
      "picture": "company_loyalty.png",
      "technologies": "Android, Javascript, iOS, ReactiveX"
    },
    {
      "company": "ATOS Worldline",
      "title": "System and software developer",
      "short_desc": "Migrate an existing set of applications to the Redhat Openshift platform",
      "desc": "My mission during this internship was to migrate an existing set of applications connected alltogether by a bus (Geoserver, admin panel, Rok4..) to the company's openshift server. I've done a lot of linux configuration, openshift cartriges creation and some java to prepare the applications to be used as a PaaS",
      "date_begin": "11/05/2015",
      "end_date": "11/09/2015",
      "picture": "company_worldline.jpg",
      "technologies": "Linux, Java, ShellScript, Openshift, Vagrant"
    },
    {
      "company": "ETIC Junior Enterprise",
      "title": "Android developer",
      "short_desc": "Developed a Tinder like application for a junior enterprise's client",
      "desc": "This was my first real android project, with a real client. I had to respect a precise design given by the client and also implements the famous Tinder card animation (there was no library at the time).\nI also dove into the Android Facebook SDK as the application had a string integtration with Facebook.",
      "date_begin": "01/05/2015",
      "end_date": "01/11/2015",
      "picture": "company_etic.png",
      "technologies": "Android, Facebook SDK",
      "size" : "small"
    }

  ],
  "project": [
    {
      "title": "FollowMyLyon",
      "short_desc": "Android application that automatically plan your visit in Lyon",
      "desc": "During my fourth year at INSA, we had two weeks to build an application using data about the city of Lyon.\nI've been team leader for this project. My roles were to be sure that my teammates knew what they have to do and how to do it. I've also made sure that they can all easily run the development environment on their personnal computer (wether it was a Mac, or on Windows.\n\nI've decided to use Python with Flask as the REST server since it is really fast to set up and we had only two weeks. I taught my friends how to begin with Python and I was often helping them making sure they were not blocked. I mainly produced code on the Android part because it is my best skill and the other wanted to learn Python.\n I also did a lot of DevOps work to build the development environment. For this I installed Python and a MySQL database inside a Docker container, the same that would run on the server. To ease the installation of Docker (on Windows especially), I made it run inside a vagrant generated VM. So in one click, the environment was set up in everybody's PC. That was really exciting'\n\nThe app is available on the <a href=\"https://play.google.com/store/apps/details?id=fr.vcaen.lyontour\">Play Store</a> but unfortunately the server is not running anymore because of performance issues that I don't have time to repair. You can still find the source code on my <a href=\"http://github.com/vcaen\">github</a>",
      "url": "",
      "picture": "project_followmylyon.png",
      "date_begin":"12/04/2015"
    },
    {
      "title": "Vocalise",
      "short_desc" : "Software to help handicapped children with trouble to speak to enhance their elocution.",
      "desc": "During my associate degree, an organization looked for our help to build a software. \n\nThey needed a software to help physically handicapped children to work on their speech. In fact, they had trouble to listen to what they were saying.\n I took the lead of the team and we developed a software with colorful animations and drawing illustrating the specificities of the sound made by the children. I divided my team of 6 people into 3 groups, one for the aniations, one for the navigation, and a friend and I did the sound analysis. \n\n We had to work on three specificities: the duration of the sound, the intensity of the sound and wether or not the vocal chord were vibrating. This last part was very challenging but I did manage to find an algorithm that worked pretty well. I will write a blog post about it.\n\nAt the end, the organization were really satisfied. I even been told by my teacher that they don't see such a project lead every year, and they were impressed. I have to they this is the project I am the most proud of.",
      "picture": "project_vocalise.png"

    }
  ],
  "education": [
    {
      "school": "INSA Lyon, France",
      "degree": "M.Sc in Software and IT Engineering",
      "picture": "education_insa.jpg",
      "desc": "I have earned both engineering et management skills during my studies at INSA de Lyon.\nOn the technical side, I learnt C programming language on embedded devices like MSP430 and ARM devices.\n I have also learn to understand, analyse and design large maintainable information system process for companies."
    },
    {
      "school": "VIA University College, Horsens, Danemark",
      "degree": "Erasmus exchange",
      "picture": "education_horsens.jpg",
      "desc": "I did my fourth semester of my associate degree in Denmark, to discover what it's like to live abroad and to improve my English.\n I took courses on Android programming, Embedded system and Security"
    },
    {
      "school": "IUT Robert Schuman, Strasbourg, France",
      "degree": "Associate Degree in Software Engineering",
      "picture": "education_iut.jpg",
      "desc": "Technical degree in computer sciences. My main subjects were Java Programming, Algorithm, Database Design and SQL, Website development",
      "size" : "small"
    }
  ],
  "skills": [
    "Android",
    "Embedded System",
    "Linux",
    "Python",
    "JS"
  ]
}